{
  "format": "layers-model",
  "generatedBy": "keras v3.10.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.10.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "MLP",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [
                null,
                8
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input",
              "batch_input_shape": [
                null,
                8
              ]
            },
            "name": "input",
            "inbound_nodes": []
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 256,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": {
                "module": "keras.regularizers",
                "class_name": "L1L2",
                "config": {
                  "l1": 0.0,
                  "l2": 0.0001
                },
                "registered_name": null
              },
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [
              [
                [
                  "input",
                  0,
                  0
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization",
            "inbound_nodes": [
              [
                [
                  "dense",
                  0,
                  0
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "activation": "relu"
            },
            "name": "activation",
            "inbound_nodes": [
              [
                [
                  "batch_normalization",
                  0,
                  0
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.3,
              "seed": null,
              "noise_shape": null
            },
            "name": "dropout",
            "inbound_nodes": [
              [
                [
                  "activation",
                  0,
                  0
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 128,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": {
                "module": "keras.regularizers",
                "class_name": "L1L2",
                "config": {
                  "l1": 0.0,
                  "l2": 0.0001
                },
                "registered_name": null
              },
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_1",
            "inbound_nodes": [
              [
                [
                  "dropout",
                  0,
                  0
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_1",
            "inbound_nodes": [
              [
                [
                  "dense_1",
                  0,
                  0
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "activation": "relu"
            },
            "name": "activation_1",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_1",
                  0,
                  0
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.3,
              "seed": null,
              "noise_shape": null
            },
            "name": "dropout_1",
            "inbound_nodes": [
              [
                [
                  "activation_1",
                  0,
                  0
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 64,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": {
                "module": "keras.regularizers",
                "class_name": "L1L2",
                "config": {
                  "l1": 0.0,
                  "l2": 0.0001
                },
                "registered_name": null
              },
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_2",
            "inbound_nodes": [
              [
                [
                  "dropout_1",
                  0,
                  0
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_2",
            "inbound_nodes": [
              [
                [
                  "dense_2",
                  0,
                  0
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "activation": "relu"
            },
            "name": "activation_2",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_2",
                  0,
                  0
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "output",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 2,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "output",
            "inbound_nodes": [
              [
                [
                  "activation_2",
                  0,
                  0
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "input",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "output",
            0,
            0
          ]
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "batch_normalization/gamma",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/beta",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_mean",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_variance",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_mean",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_variance",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/kernel",
          "shape": [
            8,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            256,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            128,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "output/kernel",
          "shape": [
            64,
            2
          ],
          "dtype": "float32"
        },
        {
          "name": "output/bias",
          "shape": [
            2
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}